[{"icon":"rocket_launch","title":"Pasja do kodu","text":"Uwielbiam dopracowane UI, minimalizm, czytelny kod i automatyzację frontendu. Lubię łamać schematy, by tworzyć rzeczy szybkie, lekkie i estetyczne","fg":"#fff","bg":"#4a148c"},{"icon":"code_blocks","title":"Obsesja na punkcie detali","text":"Każdy piksel ma znaczenie. Tworzę interfejsy, które są nie tylko piękne, ale też intuicyjne. Wierzę, że doskonałość kryje się w prostocie i elegancji wykonania","fg":"#fff","bg":"#1a237e"},{"icon":"palette","title":"Wizualna harmonia","text":"Łączę estetykę z funkcjonalnością. Każdy projekt to opowieść wyrażona przez kolory, typografię i przestrzeń. Minimalizm to moja filozofia projektowa","fg":"#fff","bg":"#bf360c"},{"icon":"speed","title":"Wydajność przede wszystkim","text":"Szybkość ładowania i płynność animacji to podstawa. Optymalizuję każdą linię kodu, by użytkownicy mogli cieszyć się błyskawicznym doświadczeniem","fg":"#fff","bg":"#1b5e20"},{"icon":"auto_awesome","title":"Innowacyjne rozwiązania","text":"Nie boję się eksperymentować z nowymi technologiami. Tworzę prototypy, które wyznaczają trendy i inspirują innych developerów do działania","fg":"#fff","bg":"#e65100"},{"icon":"psychology","title":"UX to moja religia","text":"Każdy klik, każda interakcja jest przemyślana. Analizuję zachowania użytkowników i tworzę interfejsy, które przewidują ich potrzeby","fg":"#fff","bg":"#880e4f"},{"icon":"science","title":"Programowanie - 1/2","text":"Pierwszy komputer bug został dosłownie znaleziony przez Grace Hopper w 1947 roku - była to prawdziwa ćma uwięziona w przekaźniku komputera Harvard Mark II. JavaScript został stworzony w zaledwie 10 dni przez Brendana Eicha w 1995 roku, co tłumaczy niektóre jego dziwaczne zachowania. Pierwszy algorytm na świecie został napisany przez Adę Lovelace w 1843 roku - 100 lat przed powstaniem pierwszego komputera! World Wide Web zostało udostępnione za darmo przez Tima Berners-Lee, który mógł zostać milionerem, ale zdecydował się podarować swój wynalazek ludzkości.","fg":"#fff","bg":"#1565c0"},{"icon":"science","title":"Programowanie - 2/2","text":"Kod źródłowy Apollo 11, który zabrał ludzi na Księżyc, miał tylko 145 000 linii kodu - mniej niż współczesna aplikacja na Facebooka. Pierwszy spam email został wysłany w 1978 roku przez Gary'ego Thuerk'a do 393 użytkowników ARPANET, promując komputery DEC. Linux, jeden z najpopularniejszych systemów operacyjnych, został stworzony przez 21-letniego studenta Linusa Torvaldsa jako hobby project. Dzisiaj napędza większość serwerów internetowych i urządzeń Android na świecie. Python został nazwany na cześć komedii 'Monty Python's Flying Circus', a nie na cześć węża pythona.","fg":"#fff","bg":"#1565c0"},{"icon":"public","title":"Internet - 1/2","text":"Każdego dnia wysyłanych jest ponad 300 miliardów emaili, z czego aż 85% to spam. Google przetwarza ponad 8,5 miliarda wyszukiwań dziennie, co oznacza około 99 tysięcy zapytań na sekundę. Pierwsza strona internetowa w historii nadal istnieje i można ją odwiedzić pod adresem info.cern.ch - została stworzona w 1991 roku przez Tima Berners-Lee. YouTube ma ponad 2 miliardy zalogowanych użytkowników miesięcznie, którzy oglądają ponad miliard godzin filmów dziennie. To więcej niż Netflix i Facebook razem wzięte.","fg":"#fff","bg":"#2e7d32"},{"icon":"public","title":"Internet - 2/2","text":"Internet waży około 50 gramów - tyle co jajko kurze. Ta masa składa się z elektronów przechowujących dane na serwerach na całym świecie. Pierwsza transakcja online miała miejsce w 1994 roku - ktoś kupił płytę CD Stinga za 12,48 dolara plus koszty wysyłki. Amazon rozpoczął działalność jako księgarnia internetowa w garażu Jeffa Bezosa w 1994 roku. Dzisiaj jest jedną z największych korporacji świata, generując przychody przekraczające PKB wielu krajów. Internet składa się z ponad 1,7 miliarda stron internetowych, a co minutę przesyłanych jest 41 milionów wiadomości WhatsApp.","fg":"#fff","bg":"#2e7d32"},{"icon":"psychology","title":"Ludzki mózg - 1/2","text":"Ludzki mózg składa się z około 86 miliardów neuronów, każdy połączony z tysiącami innych, tworząc sieć bardziej złożoną niż cały internet. Mózg zużywa około 20% całej energii naszego ciała, mimo że stanowi tylko 2% masy ciała. Podczas snu mózg nie odpoczyna - przeciwnie, jest bardzo aktywny, konsolidując wspomnienia i usuwając toksyny. Zjawisko 'déjà vu' doświadcza około 97% ludzi i może być związane z krótkim opóźnieniem między półkulami mózgowymi. Mózg nie posiada receptorów bólu, dlatego chirurdzy mogą operować go przy przytomnym pacjencie.","fg":"#fff","bg":"#7b1fa2"},{"icon":"psychology","title":"Ludzki Mózg - 2/2","text":"Multitasking to mit - mózg nie potrafi robić dwóch rzeczy jednocześnie, tylko szybko przełącza się między zadaniami, co obniża efektywność o 40%. Nauka podczas snu rzeczywiście działa - badania pokazują, że można przyspieszyć naukę języków i umiejętności motorycznych. Mózg jest w 75% zbudowany z wody, a nawet 2% odwodnienie może wpłynąć na koncentrację i pamięć. Neuroplastyczność oznacza, że mózg może się zmieniać przez całe życie - nigdy nie jest za późno na naukę nowych umiejętności. Każdy dzień tworzymy około 70 000 myśli, z czego 95% to te same myśli co wczoraj.","fg":"#fff","bg":"#7b1fa2"},{"icon":"rocket","title":"1. Ciemna Energia","text":"Około 68% Wszechświata składa się z ciemnej energii.","bg":"#1B263B","fg":"#E0E6ED"},{"icon":"star","title":"2. Neutronowe Gęstości","text":"Łyżeczka materii gwiazdy neutronowej ważyłaby miliard ton.","bg":"#2C3E50","fg":"#F5F9FF"},{"icon":"waves","title":"3. Głębia Ciszy","text":"Mariana Trench to najgłębszy punkt oceanów – ponad 11 km głębokości.","bg":"#014F86","fg":"#EAF4F4"},{"icon":"travel_explore","title":"4. Podwodne Ruiny","text":"Nieodkryte cywilizacje mogą spoczywać pod wodą.","bg":"#026873","fg":"#D0EBE8"},{"icon":"functions","title":"5. Nieskończoność","text":"Istnieje wiele rodzajów nieskończoności – niektóre są 'większe' od innych.","bg":"#5C677D","fg":"#FFFFFF"},{"icon":"calculate","title":"6. Liczby Pierwsze","text":"Największa znana liczba pierwsza ma ponad 24 miliony cyfr.","bg":"#4A536B","fg":"#F0F0F0"},{"icon":"translate","title":"7. Językowy Rekord","text":"Osoba znała płynnie ponad 50 języków.","bg":"#C08457","fg":"#FAF4ED"},{"icon":"menu_book","title":"8. Uniwersalny Rdzeń","text":"Ponad 60% języków świata należy do 9 rodzin językowych.","bg":"#B47B59","fg":"#FFF9F5"}]
